[
  {
    "versionName": "v1.0.8",
    "date": "24th January 2025", 
    "time": "10:50 PM IST",
    "title": "⚡Persistent Player⚡",
    "description": "Closing the browser while playing won't remove your current song and queue.",
    "changes": [
      "You can play a song from a context and go away. When you come back, that song will be there along with the context and the timestamp.",
      "Added Odia Language to the greetings."
    ]
  },
  {
    "versionName": "v1.0.7",
    "date": "22th January 2025", 
    "time": "11:10 PM IST",
    "title": "⚡Custom Playlists⚡",
    "description": "You can now create custom playlists.",
    "changes": [
      "You can now create custom playlists, rename them, delete them.",
      "There is a new right-click context menu that appears on the global search, album songs, liked songs and other playlists from where you can add songs to a specific playlist. In playlists section, you can also remove songs by right-clicking.",
      "The 'Song Addition to Playlist' modal opens up and displays all your playlists in alphabetical order.",
      "Later, we will build the 'Your Library' page, but for now, you can see all your playlists in the homepage, under the title 'Your Playlists'. You can see your last 5 recently accessed playlists on the sidebar.",
      "Changed the look of the volume slider where it appears only on hover."
    ]
  },
  {
    "versionName": "v1.0.6",
    "date": "21th January 2025", 
    "time": "12:10 AM IST",
    "title": "⚡Stabilised Features and Simplified Approach⚡",
    "description": "Added persistency to liked songs, changed queue mechanisms, changed vibes.",
    "changes": [
      "If you turn on 'shuffle' or change 'repeat' mode for a playlist or album, that status is stored in the database. So, even when you come back later, it is remembered.",
      "Queue window on the right is resizable now. The last size is stored in your browser's cache so it is device specific, not account specific so you don't have to constantly change it.",
      "You can no longer drag songs from the context queue to the priority queue and vice-versa. This prevents unnecessary bugs and stabilises queue performance. An easy mechanism is introduced, if you click and drag a context queue song right, you can add it to the priority queue and then re-arrange it from there if you absolutely need to.",
      "You can remove songs from the priority and context queue by using the 'X' button or by dragging left.",
      "Changed main seek slider and volume slider colour from white to purple to match the theme."
    ]
  },
{
    "versionName": "v1.0.5",
    "date": "18th January 2025", 
    "time": "01:10 AM IST",
    "title": "⚡ Modern Queue ⚡",
    "description": "Rearrange songs in the queue.",
    "changes": [
      "Changed the queue to a small component from a dedicated page",
      "Move the songs around the queue as you wish",
      "Improved queue animations",
      "Changed the home horizontal arrow colours for better visibility",
      "Local cached like button to prevent appearance delay"
    ]
  },

  {
    "versionName": "v1.0.4",
    "date": "2026-01-16",
    "time": "22:20",
    "title": "⚡ Search Function! ⚡",
    "description": "Now you can search for a song easily.",
    "changes": [
      "Added search bar",
      "You can add to queue directly from search",
      "You can like from search bar as well"
    ]
  },
  {
    "versionName": "v1.0.4",
    "date": "2026-01-16",
    "time": "",
    "title": "⚡ Quality of Life Improvements ⚡",
    "description": "A lot of tiny changes to make your life easier. Still there are some very specific bugs which need to be taken care of.",
    "changes": [
      "Liked Songs playlist with framer-motion animation",
      "Like Songs playlist heading for easy column identification",
      "Clickable album name on the Liked Songs playlist",
      "Added the 'Add To Queue' button beside the heart button",
      "You can now add songs from anywhere to the queue",
      "You can click on album names to redirect to respective album in queue page",
      "Added queue page animation, handled wrapping of songs at start and end"
    ]
  },

  {
    "versionName": "v1.0.3",
    "date": "2026-01-16",
    "time": "14:55",
    "title": "⚡ New Modal Fetch Method ⚡",
    "description": "Now changing just a JSON file will automatically fetch the update details for the modal.",
    "changes": [
      "Fixed an issue with Liked Songs playlist where in view liked songs didn't appear",
      "Fixed seekbar and timer syncing issues when switching contexts",
      "Corrected volume slider behavior to prevent accidental song restarts",
      "Added smooth hover effects to the playback slider handle"
    ]
  },
  {
    "versionName": "v1.0.2",
    "date": "2026-01-16",
    "time": "14:45",
    "title": "Context Aware Playback! ⚡",
    "description": "Now the player is fully aware of exactly where your song is being played from.",
    "changes": [
      "Isolated song playback state between Album and Liked contexts",
      "Fixed seekbar and timer syncing issues when switching contexts",
      "Corrected volume slider behavior to prevent accidental song restarts",
      "Added smooth hover effects to the playback slider handle"
    ]
  },
  {
    "versionName": "v1.0.1",
    "date": "2026-01-15",
    "time": "10:30",
    "title": "Initial Release",
    "description": "Welcome to MuseBuzz!",
    "changes": [
      "Core music streaming engine live",
      "Supabase authentication integration",
      "Full library and album support"
    ]
  }
]