[
  {
    "versionName": "v1.13",
    "date": "25th Feb 2025", 
    "time": "7:15 PM IST",
    "title": "⚡Changed Login System⚡",
    "description": "Removed Email verification for login",
    "changes": [
      "Now, you dont have to verify emails for login.",
      "If you use google login, then you still have to use a real google account.",
      "Fixed an issue where states where bleeding across accounts if you logged out and logged in the same browser in the same device without clearing cache.",
      "Fixed auth modal issue where modal didn't close after login."
    ]
  },
  {
    "versionName": "v1.12",
    "date": "25th Feb 2025", 
    "time": "4:25 AM IST",
    "title": "⚡AI Playlists Re-defined⚡",
    "description": "AI Generated Playlists use a custom machine learning model which takes in factors from your listening history, followed artists, added albums, skipped and completed songs",
    "changes": [
      "Used PyTorch for the machine learning model. Gemini API is used to creatively name those generated playlists ensuring the names are unique and does not repeat the same names back-to-back.",
      "The details fetched are listening history, saved albums and artists, songs the user skipped or completed, also their duration, and the date of the added entry in the database to penalise old listening habits and bring forward new ones.",
      "Fixed an issue with Generated Playlists page, where the 'Date Added' for each song was showing 'Mix For You'. Now the dates of each song is the same as the time the playlist is made."
    ]
  },
  {
    "versionName": "v1.11",
    "date": "24th Feb 2025", 
    "time": "7:00 PM IST",
    "title": "⚡Customised Homepage, AI Playlists, and Context Menus⚡",
    "description": "AI Generated Playlists, Context aware right-click, and add entire context to priority queue.",
    "changes": [
      "Logged in user can see generated playlists that are made for them based on their listening history.",
      "The homepage is also curated, with 'Jump Back In' section, 'More Like ...' section, and 'Made For You' Customised Generated Playlists section.",
      "You can now right-click most contexts and get the proper context menu, relevant to that context.",
      "Added a new 'Add to Queue' option for playlists, generated playlists, albums and artists which will be added to the priority queue.",
      "Changed the look of the context menu which is now consistent everywhere.",
      "Added a 'Clear' button on the priority queue which you can click and reset the entire priority queue. Context queue works normally."
    ]
  },
  {
    "versionName": "v1.11",
    "date": "12th Feb 2025", 
    "time": "12:00 PM IST",
    "title": "⚡Similar Songs in the Queue⚡",
    "description": "Based on your last songs of your playlist / album, new auto-play songs will be generated.",
    "changes": [
      "There are now three buckets in the queue - priority, context, and autoplay.",
      "You cannot move songs from one bucket to another but you can re-arrange in itself.",
      "The autoplay songs are generated based on the last 5 songs of your playlist / album.",
      "The last song has the most influence on the queue. The other 4 songs have average influence on the queue."
    ]
  },
  {
    "versionName": "v1.10",
    "date": "25th January 2025", 
    "time": "7:13 PM IST",
    "title": "⚡Artist Page⚡",
    "description": "The Artist Page has been built!",
    "changes": [
      "You can open artist pages from the search bar or the player by clicking on the artist name.",
      "You can follow artists and they will appear on your library page. They also get sorted reverse chronologically based on when you accessed them.",
      "In the artist page, you can see their profile picture, and the songs they have in album wise order for now. You can play songs from there and it is a separate play context.",
      "If you click on the image on the player on the extreme left, you will go to that song's album, if you click on the artist name then you will go to the artist page.",
      "Added a marquee scroll effect in case the width is not enough for the song name to appear on the player.",
      "Added a new filter option for artists on the 'Your Library' page.",
      "New context menus for adding artists has been added.",
      "Added 'Save to Library' button on the album header, beside the title."
    ]
  },
  {
    "versionName": "v1.9",
    "date": "25th January 2025", 
    "time": "9:38 AM IST",
    "title": "⚡Your Library Page and Sleeker Sidebar⚡",
    "description": "The 'Your Library' page is designed to show your recently added / played playlists and albums.",
    "changes": [
      "Your Library page shows you recently added / last accessed albums and playlists in reverse chronological order.",
      "The sidebar shows the first 10 entries from 'Your Library' page.",
      "Side bar contains the icons of the albums and playlists and they get re-arranged as you access them.",
      "You can filter the content of 'Your Library' to show just the albums or playlists or all.",
      "Playlists and Liked Songs page shows the album cover image beside the song title as well."
    ]
  },
  {
    "versionName": "v1.8",
    "date": "24th January 2025", 
    "time": "10:50 PM IST",
    "title": "⚡Persistent Player⚡",
    "description": "Closing the browser while playing won't remove your current song and queue.",
    "changes": [
      "You can play a song from a context and go away. When you come back, that song will be there along with the context and the timestamp.",
      "Added Odia Language to the greetings."
    ]
  },
  {
    "versionName": "v1.7",
    "date": "22th January 2025", 
    "time": "11:10 PM IST",
    "title": "⚡Custom Playlists⚡",
    "description": "You can now create custom playlists.",
    "changes": [
      "You can now create custom playlists, rename them, delete them.",
      "There is a new right-click context menu that appears on the global search, album songs, liked songs and other playlists from where you can add songs to a specific playlist. In playlists section, you can also remove songs by right-clicking.",
      "The 'Song Addition to Playlist' modal opens up and displays all your playlists in alphabetical order.",
      "Later, we will build the 'Your Library' page, but for now, you can see all your playlists in the homepage, under the title 'Your Playlists'. You can see your last 5 recently accessed playlists on the sidebar.",
      "Changed the look of the volume slider where it appears only on hover."
    ]
  },
  {
    "versionName": "v1.6",
    "date": "21th January 2025", 
    "time": "12:10 AM IST",
    "title": "⚡Stabilised Features and Simplified Approach⚡",
    "description": "Added persistency to liked songs, changed queue mechanisms, changed vibes.",
    "changes": [
      "If you turn on 'shuffle' or change 'repeat' mode for a playlist or album, that status is stored in the database. So, even when you come back later, it is remembered.",
      "Queue window on the right is resizable now. The last size is stored in your browser's cache so it is device specific, not account specific so you don't have to constantly change it.",
      "You can no longer drag songs from the context queue to the priority queue and vice-versa. This prevents unnecessary bugs and stabilises queue performance. An easy mechanism is introduced, if you click and drag a context queue song right, you can add it to the priority queue and then re-arrange it from there if you absolutely need to.",
      "You can remove songs from the priority and context queue by using the 'X' button or by dragging left.",
      "Changed main seek slider and volume slider colour from white to purple to match the theme."
    ]
  },
{
    "versionName": "v1.5",
    "date": "18th January 2025", 
    "time": "01:10 AM IST",
    "title": "⚡ Modern Queue ⚡",
    "description": "Rearrange songs in the queue.",
    "changes": [
      "Changed the queue to a small component from a dedicated page",
      "Move the songs around the queue as you wish",
      "Improved queue animations",
      "Changed the home horizontal arrow colours for better visibility",
      "Local cached like button to prevent appearance delay"
    ]
  },

  {
    "versionName": "v1.4",
    "date": "2026-01-16",
    "time": "22:20",
    "title": "⚡ Search Function! ⚡",
    "description": "Now you can search for a song easily.",
    "changes": [
      "Added search bar",
      "You can add to queue directly from search",
      "You can like from search bar as well"
    ]
  },
  {
    "versionName": "v1.3",
    "date": "2026-01-16",
    "time": "",
    "title": "⚡ Quality of Life Improvements ⚡",
    "description": "A lot of tiny changes to make your life easier. Still there are some very specific bugs which need to be taken care of.",
    "changes": [
      "Liked Songs playlist with framer-motion animation",
      "Like Songs playlist heading for easy column identification",
      "Clickable album name on the Liked Songs playlist",
      "Added the 'Add To Queue' button beside the heart button",
      "You can now add songs from anywhere to the queue",
      "You can click on album names to redirect to respective album in queue page",
      "Added queue page animation, handled wrapping of songs at start and end"
    ]
  },

  {
    "versionName": "v1.2",
    "date": "2026-01-16",
    "time": "14:55",
    "title": "⚡ New Modal Fetch Method ⚡",
    "description": "Now changing just a JSON file will automatically fetch the update details for the modal.",
    "changes": [
      "Fixed an issue with Liked Songs playlist where in view liked songs didn't appear",
      "Fixed seekbar and timer syncing issues when switching contexts",
      "Corrected volume slider behavior to prevent accidental song restarts",
      "Added smooth hover effects to the playback slider handle"
    ]
  },
  {
    "versionName": "v1.1",
    "date": "2026-01-16",
    "time": "14:45",
    "title": "Context Aware Playback! ⚡",
    "description": "Now the player is fully aware of exactly where your song is being played from.",
    "changes": [
      "Isolated song playback state between Album and Liked contexts",
      "Fixed seekbar and timer syncing issues when switching contexts",
      "Corrected volume slider behavior to prevent accidental song restarts",
      "Added smooth hover effects to the playback slider handle"
    ]
  },
  {
    "versionName": "v1.0",
    "date": "2026-01-15",
    "time": "10:30",
    "title": "Initial Release",
    "description": "Welcome to MuseBuzz!",
    "changes": [
      "Core music streaming engine live",
      "Supabase authentication integration",
      "Full library and album support"
    ]
  }
]